## Exercise 1: Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.

In [1]:
import pandas
import numpy as np

In [2]:
import pandas as pd

In [ ]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5,np.nan, 9, 20, 14.5,np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

In [ ]:
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data,index = labels)

In [6]:
print("Original dataframe:")
df

Original dataframe:

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

## Exercise 2: Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.
##### Use Data from previous problem

In [7]:
print("No of attempts in exam:")
print(df[(df['attempts'] < 2) & (df['score'] > 15)])

No of attempts in exam:
    name  score  attempts qualify
j  Jonas   19.0         1     yes

## Exerise 3: Change the value in row 'd' to 11.5 
##### Use Data from previous questions

In [8]:
print("Change the score in row 'd' to 11.5:")
##df.loc['d', 'score'] = 11.5
df.iloc[3,1] = 11.5
df

Change the score in row 'd' to 11.5:

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

## Exercise 4: Write a Pandas program to calculate the sum of the examination attempts by the students. (Question continuation of data from question 2)
##### Use Data from previous questions

In [9]:
print(df['attempts'])
print("Sum of the exam attempts:")
print(df['attempts'].sum())

a    1
b    3
c    2
d    3
e    2
f    3
g    1
h    1
i    2
j    1
Name: attempts, dtype: int64
Sum of the exam attempts:
19

## Exercise 5: Drop a list of rows from a specified DataFrame
###### data: 
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}

In [13]:
data2 = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}

In [14]:
labels = ['a', 'b', 'c', 'd', 'e']
df2 = pd.DataFrame(data2,index = labels)
df2

   col1  col2  col3
a     1     4     7
b     4     5     8
c     3     6     9
d     4     7     0
e     5     8     1

In [15]:
df2.drop(df2.index[[2,4]], inplace=True)
df2

   col1  col2  col3
a     1     4     7
b     4     5     8
d     4     7     0

## Exercise 6: Write a function that checks whether a given column is present in a DataFrame or not
###### data: 
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}

Check if col4 and col1 is present

In [16]:
def colcheck(df3):
    if 'col5' in df3.columns:
            print("col5 is present in dataframe:")
    else:
            print("col5 is not present in dataframe")
    if 'col1' in df3.columns:
            print("col1 is present in dataframe")
    else:
            print("col1 is not present in dataframe:")            

data3 = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
labels = ['a', 'b', 'c', 'd', 'e']
df3 = pd.DataFrame(data3,index = labels)
print("Original dataframe is:")
print(df3)
colcheck(df3)
df3.columns

Original dataframe is:
   col1  col2  col3
a     1     4     7
b     2     5     8
c     3     6    12
d     4     9     1
e     7     5    11
col5 is not present in dataframe
col1 is present in dataframe

Index(['col1', 'col2', 'col3'], dtype='object')

## Exercise 7: Write a function that returns the column index number from column name of a given DataFrame

###### data: 
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}

##### HINT: Try using a function called get_loc():
Syntax: 
dataframe.columns.get_loc()

In [17]:
def colval(df4):
    print("column Index in dataframe is:")
    return(df4.columns.get_loc('col3'))


data4 = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
labels = ['a', 'b', 'c', 'd', 'e']
df4 = pd.DataFrame(data4,index = labels)
print("Original dataframe is:")
print(df4)
colval(df4)

Original dataframe is:
   col1  col2  col3
a     1     4     7
b     2     5     8
c     3     6    12
d     4     9     1
e     7     5    11
column Index in dataframe is:

2

## Exercise 8: Write a Pandas program to select all columns, except one given column in a DataFrame.
###### Use same data as previous problem

In [34]:
data5 = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
labels = ['a', 'b', 'c', 'd', 'e']
df5 = pd.DataFrame(data5,index = labels)
print("Original dataframe is:")
print(df5)
print("Modified dataframe is:")
df6 = df5.loc[:, df5.columns != 'col3']
print(df6)

Original dataframe is:
   col1  col2  col3
a     1     4     7
b     2     5     8
c     3     6    12
d     4     9     1
e     7     5    11
Modified dataframe is:
   col1  col2
a     1     4
b     2     5
c     3     6
d     4     9
e     7     5

## Exercise 9:  Write a Pandas program to remove last n rows of a given DataFrame.

In [12]:
data6 = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
labels = ['a', 'b', 'c', 'd', 'e']
df6 = pd.DataFrame(data6,index = labels)
print("Original dataframe is:")
print(df6)
print("Modified dataframe is:")
df7 = df6.iloc[:2]
print(df7)

Original dataframe is:
   col1  col2  col3
a     1     4     7
b     2     5     8
c     3     6    12
d     4     9     1
e     7     5    11
Modified dataframe is:
   col1  col2  col3
a     1     4     7
b     2     5     8

## Exercise 10: Display the movies longer than 30 minutes and shorter than 360 minutes
use IMDB-Movie-Data.csv

In [28]:
df = pd.read_csv("IMDB-Movie-Data.csv")
print("Original dataframe is:")
print(df)
df.info()
rundf = df[['Title', 'Runtime (Minutes)']]
print(rundf)
disp = rundf[(rundf['Runtime (Minutes)'] >= 30) & (rundf['Runtime (Minutes)'] <= 360)]
print("Movies longer than 30 min and shorter than 360 min:")
print(disp)

Original dataframe is:
     Rank                    Title                     Genre  \
0       1  Guardians of the Galaxy   Action,Adventure,Sci-Fi
1       2               Prometheus  Adventure,Mystery,Sci-Fi
2       3                    Split           Horror,Thriller
3       4                     Sing   Animation,Comedy,Family
4       5            Suicide Squad  Action,Adventure,Fantasy
..    ...                      ...                       ...
995   996     Secret in Their Eyes       Crime,Drama,Mystery
996   997          Hostel: Part II                    Horror
997   998   Step Up 2: The Streets       Drama,Music,Romance
998   999             Search Party          Adventure,Comedy
999  1000               Nine Lives     Comedy,Family,Fantasy

                                           Description              Director  \
0    A group of intergalactic criminals are forced ...            James Gunn
1    Following clues to the origin of mankind, a te...          Ridley Scott
2    Three girls are kidnapped by a man with a diag...    M. Night Shyamalan
3    In a city of humanoid animals, a hustling thea...  Christophe Lourdelet
4    A secret government agency recruits some of th...            David Ayer
..                                                 ...                   ...
995  A tight-knit team of rising investigators, alo...             Billy Ray
996  Three American college students studying abroa...              Eli Roth
997  Romantic sparks occur between two dance studen...            Jon M. Chu
998  A pair of friends embark on a mission to reuni...        Scot Armstrong
999  A stuffy businessman finds himself trapped ins...      Barry Sonnenfeld

                                                Actors  Year  \
0    Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...  2014
1    Noomi Rapace, Logan Marshall-Green, Michael Fa...  2012
2    James McAvoy, Anya Taylor-Joy, Haley Lu Richar...  2016
3    Matthew McConaughey,Reese Witherspoon, Seth Ma...  2016
4    Will Smith, Jared Leto, Margot Robbie, Viola D...  2016
..                                                 ...   ...
995  Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...  2015
996  Lauren German, Heather Matarazzo, Bijou Philli...  2007
997  Robert Hoffman, Briana Evigan, Cassie Ventura,...  2008
998  Adam Pally, T.J. Miller, Thomas Middleditch,Sh...  2014
999  Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...  2016

     Runtime (Minutes)  Rating   Votes  Revenue (Millions)  Metascore
0                  121     8.1  757074              333.13       76.0
1                  124     7.0  485820              126.46       65.0
2                  117     7.3  157606              138.12       62.0
3                  108     7.2   60545              270.32       59.0
4                  123     6.2  393727              325.02       40.0
..                 ...     ...     ...                 ...        ...
995                111     6.2   27585                 NaN       45.0
996                 94     5.5   73152               17.54       46.0
997                 98     6.2   70699               58.01       50.0
998                 93     5.6    4881                 NaN       22.0
999                 87     5.3   12435               19.64       11.0

[1000 rows x 12 columns]
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Title               1000 non-null   object
 2   Genre               1000 non-null   object
 3   Description         1000 non-null   object
 4   Director            1000 non-null   object
 5   Actors              1000 non-null   object
 6   Year                1000 non-null   int64
 7   Runtime (Minutes)   1000 non-null   int64
 8   Rating              1000 non-null   float64
 9   Votes               1000 non-null   int64
 10  Revenue (Millions)  872 non-null    float64
 11  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB
                       Title  Runtime (Minutes)
0    Guardians of the Galaxy                121
1                 Prometheus                124
2                      Split                117
3                       Sing                108
4              Suicide Squad                123
..                       ...                ...
995     Secret in Their Eyes                111
996          Hostel: Part II                 94
997   Step Up 2: The Streets                 98
998             Search Party                 93
999               Nine Lives                 87

[1000 rows x 2 columns]
Movies longer than 30 min and shorter than 360 min:
                       Title  Runtime (Minutes)
0    Guardians of the Galaxy                121
1                 Prometheus                124
2                      Split                117
3                       Sing                108
4              Suicide Squad                123
..                       ...                ...
995     Secret in Their Eyes                111
996          Hostel: Part II                 94
997   Step Up 2: The Streets                 98
998             Search Party                 93
999               Nine Lives                 87

[1000 rows x 2 columns]